app/views/contract_templates/index.html.erb

SELECT COUNT(*) FROM "contracts" WHERE "contracts"."contract_template_id" = 1
---
                </td>
                <td class="align-middle"><%= template.contracts.count %></td>