app/controllers/clients_controller.rb

  def index
    @clients = Client.order(:name)
---
SELECT "clients".* FROM "clients" ORDER BY "clients"."name" ASC

  def set_cep_from_code
    cep_code = params.dig(:client, :cep_code)&.gsub(/\D/, "")
    return if cep_code.blank?
---
SELECT 1 AS one FROM "clients" LIMIT 1