app/controllers/contract_templates_controller.rb

SELECT "contract_templates".* FROM "contract_templates" ORDER BY "contract_templates"."name" ASC
---
  def index
    @templates = ContractTemplate.order(:name)