app/controllers/contracts_controller.rb

  def index
    @contracts = Contract.includes(:property, :seller, :buyer, :tenant).order(created_at: :desc)
---
SELECT "contracts".* FROM "contracts" ORDER BY "contracts"."created_at" DESC
SELECT "properties".* FROM "properties" WHERE "properties"."id" IN (5, 2, 1)