app/controllers/properties_controller.rb

  def index
    @properties = Property.includes(:owner, cep: { neighborhood: { city: :state } }).order(:title)
---
SELECT "properties".* FROM "properties" ORDER BY "properties"."title" ASC
SELECT "states".* FROM "states" WHERE "states"."id" IN (52, 46)

  def set_cep_from_code
    cep_code = params.dig(:property, :cep_code)&.gsub(/\D/, "")
    return if cep_code.blank?
---
SELECT 1 AS one FROM "properties" LIMIT 1